In [1]:
!pip install db-sqlite3

Requirement already satisfied: db-sqlite3 in c:\users\asustuf\anaconda3\lib\site-packages (0.0.1)
Requirement already satisfied: db in c:\users\asustuf\anaconda3\lib\site-packages (from db-sqlite3) (0.1.1)
Requirement already satisfied: antiorm in c:\users\asustuf\anaconda3\lib\site-packages (from db->db-sqlite3) (1.2.1)

In [2]:
import sqlite3

In [3]:
# create a connection object
conn = sqlite3.connect("Instructor.db")  # The file is created along the location of this notebook

In [4]:
# create a cursor object
cursor_obj = conn.cursor()

## Create a Table

In [5]:
table = """CREATE TABLE INSTRUCTOR(ID INTEGER PRIMARY KEY NOT NULL,FNAME VARCHAR(20),LNAME VARCHAR(20),CITY VARCHAR(20),CCODE CHAR(2));"""

cursor_obj.execute(table)

print("Table is ready")

Table is ready

## Insert data into the table

In [7]:
cursor_obj.execute('''INSERT INTO INSTRUCTOR VALUES(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')''')

In [8]:
cursor_obj.execute('''insert into INSTRUCTOR values (2, 'Raul', 'Chong', 'Markham', 'CA'), (3, 'Hima', 'Vasudevan', 'Chicago', 'US')''')

## Query Data in the table

In [9]:
statement = '''Select * from instructor;'''

In [10]:
cursor_obj.execute(statement)

output = cursor_obj.fetchall()
for row in output:
    print(row)

(1, 'Rav', 'Ahuja', 'TORONTO', 'CA')
(2, 'Raul', 'Chong', 'Markham', 'CA')
(3, 'Hima', 'Vasudevan', 'Chicago', 'US')

## Retrieve data into Pandas

In [11]:
import pandas as pd

In [13]:
# retrieve the result query into pandas dataframe
df = pd.read_sql_query("Select * from instructor;",conn)

In [14]:
#print the dataframe
df

   ID FNAME      LNAME     CITY CCODE
0   1   Rav      Ahuja  TORONTO    CA
1   2  Raul      Chong  Markham    CA
2   3  Hima  Vasudevan  Chicago    US

In [17]:
df[['FNAME']]

  FNAME
0   Rav
1  Raul
2  Hima

In [18]:
df.shape

(3, 5)

## Close the Connection

In [19]:
#close the connection
conn.close()